In [1]:
from main import *
import sys
sys.path.insert(1, str(Path().cwd().parent.joinpath('config')))
from config import DATA_DIR, FILE_PELICULAS, FILE_PERSONAS, FILE_SCORES, FILE_TRABAJADORES, FILE_USUARIOS
import pandas as pd

In [2]:
# inicializaci√≥n de la clase
usr = Usuarios(dir_database=DATA_DIR.joinpath(FILE_USUARIOS))
pers = Personas(dir_database=DATA_DIR.joinpath(FILE_PERSONAS))

La base de datos Usuarios fue cargada exitosamente.
La base de datos Personas fue cargada exitosamente.

In [3]:
generate_user()

{'id': 4911,
 'occupation': 'Teacher, secondary school',
 'active_since': '1985-06-15 03:31:41'}

In [4]:
# funcion que genera una persona
generate_person()

{'id': 2243,
 'full_name': 'Larry Hughes',
 'year_of_birth': 1987,
 'gender': 'F',
 'zip_code': '52256'}

In [5]:
# crea una persona pero no la guarda en la base de datos
persona_1 = Personas(**generate_person())

# muestra la persona
persona_1

Persona: Casey Jenkins, M, 2000, 58807

In [6]:
# muestra los ultimos 5 elementos de la base de datos
persona_1.database.tail()

      id       Full Name  year of birth Gender Zip Code
938  939   Kim Privitera           1972      F    33319
939  940    Louis Quarry           1966      M    02215
940  941  Quinton Reamer           1978      M    97229
941  942    Ruby Bridges           1950      F    78209
942  943  Dannie Cintron           1976      M    77841

In [7]:
# agrego un elemento a la base de datos
persona_1.new(element=generate_person())

Elemento creado exitosamente.

In [8]:
# muestra los ultimos 5 elementos de la base de datos
persona_1.database.tail()

       id       Full Name  year of birth Gender Zip Code
939   940    Louis Quarry           1966      M    02215
940   941  Quinton Reamer           1978      M    97229
941   942    Ruby Bridges           1950      F    78209
942   943  Dannie Cintron           1976      M    77841
943  7729     Jason Smith           2022      M    90555

In [9]:
# elimino el elemento ingresado en la base de dados
persona_1.delete(index=persona_1.database.index[-1])

Elemento eliminado exitosamente.

In [10]:
# muestra los ultimos 5 elementos de la base de datos
persona_1.database.tail()

      id       Full Name  year of birth Gender Zip Code
938  939   Kim Privitera           1972      F    33319
939  940    Louis Quarry           1966      M    02215
940  941  Quinton Reamer           1978      M    97229
941  942    Ruby Bridges           1950      F    78209
942  943  Dannie Cintron           1976      M    77841

In [11]:
# agrego un elemento a la base de datos
persona_1.new(element=generate_person())
persona_1.database.tail()

Elemento creado exitosamente.

       id       Full Name  year of birth Gender Zip Code
939   940    Louis Quarry           1966      M    02215
940   941  Quinton Reamer           1978      M    97229
941   942    Ruby Bridges           1950      F    78209
942   943  Dannie Cintron           1976      M    77841
943  1808     Emily Nunez           2022      F    34975

In [12]:
ele = generate_person()
ele

{'id': 2318,
 'full_name': 'Veronica Davis',
 'year_of_birth': 2009,
 'gender': 'M',
 'zip_code': '92985'}

In [13]:
# actualizo elemento en base de datos
persona_1.update(index=942, element=ele)
persona_1.database.tail()

Elemento actualizado exitosamente.

       id       Full Name  year of birth Gender Zip Code
939   940    Louis Quarry           1966      M    02215
940   941  Quinton Reamer           1978      M    97229
941   942    Ruby Bridges           1950      F    78209
942  2318  Veronica Davis           2009      M    92985
943  1808     Emily Nunez           2022      F    34975

In [14]:
generate_person()

{'id': 9578,
 'full_name': 'Destiny Clark',
 'year_of_birth': 1999,
 'gender': 'F',
 'zip_code': '38928'}